# Introduction to Pandas
This notebook demonstrates key concepts of the pandas library, focusing on data manipulation, filtering, and working with different data formats. It is designed to be a quick reference for both intermediate users and beginners who want to understand the common operations performed with pandas.

In [2]:
import pandas as pd

In [3]:
# Create a simple dataframe
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])

print(df)
print('\n')

# Change the naming of the columns and rows
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]], index=['X', 'Y', 'Z'], columns=['A', 'B', 'C'])

print(df)
print('\n')

# Alternative way to change the naming of the columns and rows
df.columns = ['A', 'B', 'C']
df.index = ['X', 'Y', 'Z']

print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9


   A  B  C
X  1  2  3
Y  4  5  6
Z  7  8  9


   A  B  C
X  1  2  3
Y  4  5  6
Z  7  8  9

## Reading Data from Different Formats
Usually in Pandas we read data from files, rather than creating our own dataframe. Pandas supports reading data from various file formats like CSV, Excel, Parquet, and Feather. This section demonstrates how to load data into a pandas DataFrame from these different formats.

> **Note:**
> - **CSV**: Easy to use and share, but inefficient in terms of storage and data processing due to the lack of compression and type preservation.
>
> - **Feather**: Best for scenarios where speed of read/write operations is critical, particularly in memory-constrained environments.
>
> - **Parquet**: The go-to format for large-scale data storage and analytics, offering both compression and efficient querying capabilities, making it ideal for long-term, cost-efficient data storage.
>
> - **Excel**: Widely used for business reporting and analysis. It supports multiple sheets and is ideal for small to medium-sized datasets, but it can be slower to read/write compared to other formats like CSV or Parquet, and doesn't handle large datasets efficiently.
>
> To be able to use the 'read' method for files other than ***CSV***, you need to install additional packages.

In [128]:
coffee = pd.read_csv('./warmup_data/coffee.csv') # Load a csv file

In [5]:
bios = pd.read_csv('./data/bios.csv')

In [6]:
results_feather = pd.read_feather('./data/results.feather')

In [7]:
results_parquet = pd.read_parquet('./data/results.parquet') # Read a parquet file

In [8]:
olympics_data = pd.read_excel('./data/olympics-data.xlsx') # Read xlsx file, takes longer time to load

In [9]:
olympics_data = pd.read_excel('./data/olympics-data.xlsx', sheet_name='results') # Read a specific sheet. Takes significantly more time

## DataFrame Overview and Inspection
It's important to inspect and understand your data before analyzing it. This section covers methods such as `.info()`, `.head()`, `.tail()`, and `.describe()` to get an overview of the dataset.

In [10]:
df.info() # Displays a summary of the DataFrame, including data types, non-null counts, and memory usage.

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, X to Z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [11]:
df.describe() # Displays descriptive statistics (mean, median, quartiles, etc.) for numerical columns.

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [12]:
df.nunique() # Displays the number of unique values of all the columns

A    3
B    3
C    3
dtype: int64

In [13]:
df['A'].unique() # Displays the unique values of the specified column

array([1, 4, 7])

In [14]:
df.shape # Displays how many rows and cols are in this dataframe (rows, cols)

(3, 3)

In [15]:
df.size # Displays the number of elements in the dataframe

9

In [16]:
coffee.head() # Displays the first 5 entries in the dataframe (5 is default)

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [17]:
results_feather.head() # Feather file

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [18]:
results_parquet.head() # Parquet file

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [19]:
olympics_data.head() # xlsx file

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [20]:
olympics_data.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [21]:
coffee.head(10) # Displays the first 10 entries in the dataframe

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30
8     Friday    Espresso          45
9     Friday       Latte          35

In [22]:
# The same applies to tail
coffee.tail()

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [23]:
coffee.tail(10)

          Day Coffee Type  Units Sold
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [24]:
coffee.sample(10) # Displays 10 random values in the dataframe, the values picked change each time this is executed

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
6    Thursday    Espresso          40
8      Friday    Espresso          45
0      Monday    Espresso          25
7    Thursday       Latte          30
12     Sunday    Espresso          45
4   Wednesday    Espresso          35
2     Tuesday    Espresso          30
9      Friday       Latte          35
13     Sunday       Latte          35

In [25]:
coffee.sample(10, random_state=1) # Make it deterministic (Always Displays the same random values)

          Day Coffee Type  Units Sold
3     Tuesday       Latte          20
7    Thursday       Latte          30
6    Thursday    Espresso          40
2     Tuesday    Espresso          30
10   Saturday    Espresso          45
4   Wednesday    Espresso          35
1      Monday       Latte          15
12     Sunday    Espresso          45
0      Monday    Espresso          25
13     Sunday       Latte          35

## Selecting and Filtering Data
This section explains how to filter and select data using `.loc[]`, `.iloc[]`, `.at[]`, and `.iat[]`. We'll also explore how to use `.query()` for SQL-like filtering.

### Selection
Selection refers to accessing specific rows or columns in the DataFrame. Methods like `.loc[]`, `.iloc[]`, `.at[]`, and `.iat[]` are used for selecting data.

In [26]:
coffee.loc[0, 'Day'] # Access specific values, filter by rows and columns. Use .loc[Rows, Columns]

'Monday'

In [27]:
coffee.loc[[0,3,6]] # Access specific rows

        Day Coffee Type  Units Sold
0    Monday    Espresso          25
3   Tuesday       Latte          20
6  Thursday    Espresso          40

In [28]:
coffee.loc[5:9] # Can even use Python slicing notation

         Day Coffee Type  Units Sold
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30
8     Friday    Espresso          45
9     Friday       Latte          35

In [29]:
coffee.loc[5:8, ['Day', 'Units Sold']] # Combine specific rows and columns

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45

In [30]:
coffee.iloc[5:8, [0,2]] # Uses indexes values instead of naming values. Also the upper index is exclusive in the slicing notation

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30

> **Important**: If your DataFrame has a non-numeric index (e.g., dates, strings like weekdays), `.iloc` will work as intended, however `.loc` will require the exact label names. 
> Trying to access rows via integer labels with `.loc` would result in an error if the labels are not integers.

In [31]:
# Example: (Uncomment to run and make sure to reset the index values (run the read_csv code for the 'coffee.csv' file).

# coffee.index = coffee['Day']
# coffee.loc[5:8] # This will result in an error

In [32]:
coffee['Day'] # Access column by name. Can even grab multiple columns. More robust than dot notation.

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [33]:
coffee.Day # Dot notation (only works if the column name is a valid Python identifier).

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

> **Note**: `iterrows()` returns each row as a Series, making it easy to access columns by label (e.g., `row['Units Sold']`). 
> Keep in mind that iterating with `iterrows()` is slower than vectorized operations and should only be used when necessary for row-wise processing.

In [34]:
# Iterates over each row of the 'coffee' DataFrame using the '.iterrows()' method.
# For each row, it prints the index of the row, followed by the value in the 'Units Sold' column.

for index, row in coffee.iterrows():
    print(index)
    print(row['Units Sold'])
    print('\n\n')

0
25



1
15



2
30



3
20



4
35



5
25



6
40



7
30



8
45



9
35



10
45



11
35



12
45



13
35

### Filtering
Filtering refers to subsetting the DataFrame based on certain conditions, such as rows that meet a specific criterion (e.g., values greater than a threshold).

In [35]:
bios.info() # Identifies column data types to help with proper filtering (e.g., numerical, categorical, string).

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [36]:
bios.columns # Show the columns of the dataframe

Index(['athlete_id', 'name', 'born_date', 'born_city', 'born_region',
       'born_country', 'NOC', 'height_cm', 'weight_kg', 'died_date'],
      dtype='object')

In [37]:
bios.loc[bios['height_cm'] > 215, ['name', 'height_cm']] # Filter athletes by height.

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

In [38]:
bios.loc[(bios['height_cm'] > 215) & (bios['born_country'] == 'GER')] # Filter all the German athletes with height > 215 cm.

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5716,5739,Uwe Blab,1962-03-26,München (Munich),Bayern,GER,Germany West Germany,218.0,110.0,NaN

In [39]:
bios.loc[bios['name'].str.contains('Petros')] # Find the athletes that have 'Petros' in their name. Case sensitive by default.

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
3911,3924,Petros Nazarbegian,1927-05-06,Tehran,Tehran,IRI,Islamic Republic of Iran,NaN,NaN,2015-11-13
15197,15299,Petros Leonidis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
22206,22372,Petros Manos,1871-04-07,Athina (Athens),Attiki,GRE,Greece,NaN,NaN,1918-04-04
30112,30342,Petros Persakis,1879-01-01,Athina (Athens),Attiki,GRE,Greece,NaN,NaN,NaN
41402,41719,Petros Kyritsis,1953-10-15,NaN,NaN,NaN,Cyprus,174.0,76.0,NaN
42334,42657,Petros Pappas,1953-05-06,NaN,NaN,NaN,Greece,172.0,68.0,NaN
54247,54637,Stefanos-Petros Santa,1975-05-21,Cluj-Napoca,Cluj,ROU,Greece Romania,NaN,NaN,NaN
58052,58460,Petros Bourntoulis,1969-07-27,NaN,NaN,NaN,Greece,193.0,118.0,NaN
58059,58467,Petros Galaktopoulos,1945-06-07,Athina (Athens),Attiki,GRE,Greece,172.0,74.0,NaN
58094,58506,Petros Triantafyllidis,1947-01-01,Bad Berleburg,Nordrhein-Westfalen,GER,Greece,151.0,52.0,NaN
58095,58507,Petros Triantafyllidis,1971-06-05,Thessaloniki,Thessalia,GRE,Greece,180.0,104.0,NaN
61477,61926,Petros Elton,1971-04-20,NaN,NaN,NaN,Cyprus,NaN,NaN,NaN
70310,70835,Petros Pipilis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79458,80069,Petros Pavlidis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79480,80091,Petros Freskalakis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79518,80130,Petros Mexis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79536,80148,N. Petros,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79541,80153,Petros Pterneas,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79561,80173,Petros Velliotis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79607,80221,Petros Petsas,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
94145,94906,Rudik Petrosyan,1980-10-18,Gyumri,Shirak,ARM,Armenia,166.0,69.0,NaN
95611,96382,Jack Petroske,1934-08-06,Hibbing,Minnesota,USA,United States,183.0,83.0,2019-07-30
139851,143340,Amanal Petros,1995-05-17,Assab,Debubawi Kayih Bahri,ERI,Germany,NaN,NaN,NaN

In [40]:
bios.loc[bios['name'].str.contains('Petros|Leonidas')] # Can even use regex syntax for more powerful string filtering.

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1321,1328,Leonidas Asprilla,1952-07-31,NaN,NaN,NaN,Colombia,164.0,57.0,NaN
3911,3924,Petros Nazarbegian,1927-05-06,Tehran,Tehran,IRI,Islamic Republic of Iran,NaN,NaN,2015-11-13
4429,4444,Leonidas Maleckis,1966-03-08,Vilnius,Vilnius,LTU,Lithuania,178.0,71.0,NaN
8197,8241,Leonidas Njunwa,1952-08-02,NaN,NaN,NaN,United Republic of Tanzania,168.0,71.0,NaN
15197,15299,Petros Leonidis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
22206,22372,Petros Manos,1871-04-07,Athina (Athens),Attiki,GRE,Greece,NaN,NaN,1918-04-04
24365,24554,Leonidas Flores,1965-01-24,Palma,Guanacaste,CRC,Costa Rica,NaN,NaN,NaN
30112,30342,Petros Persakis,1879-01-01,Athina (Athens),Attiki,GRE,Greece,NaN,NaN,NaN
30114,30344,Leonidas Tsiklitiras,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
41402,41719,Petros Kyritsis,1953-10-15,NaN,NaN,NaN,Cyprus,174.0,76.0,NaN
42311,42634,Leonidas Lanngakis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
42334,42657,Petros Pappas,1953-05-06,NaN,NaN,NaN,Greece,172.0,68.0,NaN
54247,54637,Stefanos-Petros Santa,1975-05-21,Cluj-Napoca,Cluj,ROU,Greece Romania,NaN,NaN,NaN
55493,55889,Leonidas Kokas,1973-06-03,Korçë,Korçë,ALB,Greece,176.0,93.0,NaN
55503,55899,Leonidas Sampanis,1971-10-28,Korçë,Korçë,ALB,Greece,160.0,NaN,NaN
58052,58460,Petros Bourntoulis,1969-07-27,NaN,NaN,NaN,Greece,193.0,118.0,NaN
58059,58467,Petros Galaktopoulos,1945-06-07,Athina (Athens),Attiki,GRE,Greece,172.0,74.0,NaN
58083,58495,Leonidas Pappas,1967-10-25,Vlorë,Vlorë,ALB,Greece,NaN,NaN,NaN
58094,58506,Petros Triantafyllidis,1947-01-01,Bad Berleburg,Nordrhein-Westfalen,GER,Greece,151.0,52.0,NaN
58095,58507,Petros Triantafyllidis,1971-06-05,Thessaloniki,Thessalia,GRE,Greece,180.0,104.0,NaN
61477,61926,Petros Elton,1971-04-20,NaN,NaN,NaN,Cyprus,NaN,NaN,NaN
62798,63264,Leonidas Pelekanakis,1962-11-02,Peiraias (Piraeus),Attiki,GRE,Greece,181.0,92.0,2021-01-14
70239,70762,Leonidas Kormalis,1932-11-06,Athina (Athens),Attiki,GRE,Greece,175.0,63.0,2003-01-01
70310,70835,Petros Pipilis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79458,80069,Petros Pavlidis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79480,80091,Petros Freskalakis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79518,80130,Petros Mexis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79536,80148,N. Petros,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79541,80153,Petros Pterneas,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79561,80173,Petros Velliotis,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
79607,80221,Petros Petsas,NaN,NaN,NaN,NaN,Greece,NaN,NaN,NaN
94145,94906,Rudik Petrosyan,1980-10-18,Gyumri,Shirak,ARM,Armenia,166.0,69.0,NaN
95611,96382,Jack Petroske,1934-08-06,Hibbing,Minnesota,USA,United States,183.0,83.0,2019-07-30
108077,109218,Leonidas Kamende,1979-08-28,NaN,NaN,NaN,Kenya,183.0,78.0,NaN
139851,143340,Amanal Petros,1995-05-17,Assab,Debubawi Kayih Bahri,ERI,Germany,NaN,NaN,NaN

In [41]:
countries_i_am_interested_in = ['GRE', 'GER', 'GBR', 'USA']
bios.loc[bios['born_country'].isin(countries_i_am_interested_in) & bios['name'].str.startswith('Petros'), ['name', 'born_country']]

                         name born_country
22206            Petros Manos          GRE
30112         Petros Persakis          GRE
58059    Petros Galaktopoulos          GRE
58094  Petros Triantafyllidis          GER
58095  Petros Triantafyllidis          GRE

In [42]:
bios.query('born_country == "GRE" and height_cm >= 180') # .query can be useful for simpler, more SQL-like filtering, but it has limitations when dealing with more complex operations or non-standard column names.

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
174,175,Tasos Bavelas,1968-02-27,Athina (Athens),Attiki,GRE,Greece,180.0,76.0,NaN
175,176,Konstantinos Efremoglou,1962-12-04,Athina (Athens),Attiki,GRE,Greece,187.0,74.0,NaN
176,177,Georgios Kalovelonis,1959-08-23,Athina (Athens),Attiki,GRE,Greece,192.0,82.0,NaN
3716,3728,Georgios Stefanopoulos,1962-03-31,Peristeri,Attiki,GRE,Greece,180.0,91.0,NaN
5641,5664,Efthymios Bakatsias,1968-01-14,Athina (Athens),Attiki,GRE,Greece,196.0,85.0,NaN
...,...,...,...,...,...,...,...,...,...,...
140030,143527,Konstantinos Gkiouvetsis,1999-11-19,Chania,Kriti,GRE,Greece,191.0,90.0,NaN
140031,143528,Marios Kapotsis,1991-09-13,Chios,Voreio Aigaio,GRE,Greece,183.0,87.0,NaN
140032,143529,Stylianos Argyropoulos Kanakakis,1996-08-02,Athina (Athens),Attiki,GRE,Greece,190.0,96.0,NaN
143998,147662,Stefanos Tsitsipas,1998-08-12,Athina (Athens),Attiki,GRE,Greece,195.0,90.0,NaN
144131,147804,Anastasios Papanastasiou,1967-08-07,Athina (Athens),Attiki,GRE,Greece,186.0,87.0,NaN

## Sorting and Ranking Data
Sorting data allows you to arrange the DataFrame by specific columns. In this section, we'll use `.sort_values()` to sort the DataFrame and explain how to handle ascending and descending order.

In [43]:
coffee.sort_values('Units Sold') # Sort the values of the specified column. Ascending order by default.

          Day Coffee Type  Units Sold
1      Monday       Latte          15
3     Tuesday       Latte          20
0      Monday    Espresso          25
5   Wednesday       Latte          25
2     Tuesday    Espresso          30
7    Thursday       Latte          30
4   Wednesday    Espresso          35
9      Friday       Latte          35
13     Sunday       Latte          35
11   Saturday       Latte          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [44]:
coffee.sort_values('Units Sold', ascending=False) # Sort the values in descending order.

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [45]:
coffee.sort_values(['Units Sold', 'Coffee Type'], ascending=False) # Sorts the DataFrame by 'Units Sold' in descending order. 
# If there are ties (i.e., rows with the same 'Units Sold' value), 
# it further sorts those rows by 'Coffee Type' in descending order.

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
4   Wednesday    Espresso          35
7    Thursday       Latte          30
2     Tuesday    Espresso          30
5   Wednesday       Latte          25
0      Monday    Espresso          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [46]:
coffee.sort_values(['Units Sold', 'Coffee Type'], ascending=[0,1]) # Sorts the DataFrame by 'Units Sold' in descending order (0 means descending).
# If there are ties in 'Units Sold', it sorts by 'Coffee Type' in ascending order (1 means ascending).

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

## Modifying Data
Once you understand your data, you might need to modify it. This section demonstrates how to update specific rows or columns based on conditions and how to efficiently set values using `.loc[]` and `.at[]`.

In [47]:
coffee.loc[1, 'Units Sold'] = 10 # Set the data in the specific row and column

coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          10
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [48]:
coffee.loc[1:3, 'Units Sold'] = 10 # Sets the 'Units Sold' value to 10 for rows with index labels 1 through 3 (inclusive) using label-based indexing.
# In this DataFrame, the index is numerical, allowing both .loc (label-based) and .iloc (position-based) to work. If the index were non-numeric (e.g., 'Monday'), only .loc could be used with labels.
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          10
2     Tuesday    Espresso          10
3     Tuesday       Latte          10
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

> **Note**: 
> - **`at`/`iat`**: These methods are used specifically for accessing or setting a single value and are optimized for speed when doing so. They don't work on multiple values.
> - **`at`** uses label-based indexing, while **`iat`** uses position-based indexing.

In [49]:
coffee.at[3, 'Units Sold'] = 12

coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          10
2     Tuesday    Espresso          10
3     Tuesday       Latte          12
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [50]:
coffee.iat[3, 2] = 10

coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          10
2     Tuesday    Espresso          10
3     Tuesday       Latte          10
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

## Adding and Removing Entries
Add new rows or columns, and remove unnecessary ones. You'll learn to efficiently add new data, drop columns or rows, and reshape the DataFrame as needed.

### Adding Entries

In [51]:
import numpy as np

In [52]:
coffee = pd.read_csv('./warmup_data/coffee.csv') # In case you need to reset the dataframe.

In [53]:
coffee['price'] = 4.99 # Add a new column with a value.

coffee

          Day Coffee Type  Units Sold  price
0      Monday    Espresso          25   4.99
1      Monday       Latte          15   4.99
2     Tuesday    Espresso          30   4.99
3     Tuesday       Latte          20   4.99
4   Wednesday    Espresso          35   4.99
5   Wednesday       Latte          25   4.99
6    Thursday    Espresso          40   4.99
7    Thursday       Latte          30   4.99
8      Friday    Espresso          45   4.99
9      Friday       Latte          35   4.99
10   Saturday    Espresso          45   4.99
11   Saturday       Latte          35   4.99
12     Sunday    Espresso          45   4.99
13     Sunday       Latte          35   4.99

>**Note**: For simple, limited conditions, we can use `np.where()` for simplicity. However, when you need to apply multiple conditions, `np.select()` is more suitable, as it allows you to handle numerous conditions in a more organized and readable way.

In [54]:
coffee['new_price'] = np.where(coffee['Coffee Type'] == 'Espresso', 3.99, 5.99) # Creates a new column 'new_price' based on the condition in 'Coffee Type'.
# If the 'Coffee Type' is 'Espresso', assigns a value of 3.99 to 'new_price'. 
# Otherwise, assigns a value of 5.99. The np.where() function is used to apply this conditional logic efficiently.

coffee

          Day Coffee Type  Units Sold  price  new_price
0      Monday    Espresso          25   4.99       3.99
1      Monday       Latte          15   4.99       5.99
2     Tuesday    Espresso          30   4.99       3.99
3     Tuesday       Latte          20   4.99       5.99
4   Wednesday    Espresso          35   4.99       3.99
5   Wednesday       Latte          25   4.99       5.99
6    Thursday    Espresso          40   4.99       3.99
7    Thursday       Latte          30   4.99       5.99
8      Friday    Espresso          45   4.99       3.99
9      Friday       Latte          35   4.99       5.99
10   Saturday    Espresso          45   4.99       3.99
11   Saturday       Latte          35   4.99       5.99
12     Sunday    Espresso          45   4.99       3.99
13     Sunday       Latte          35   4.99       5.99

In [55]:
# Define multiple conditions
conditions = [
    (coffee['Coffee Type'] == 'Espresso'),       # Condition 1
    (coffee['Coffee Type'] == 'Latte'),          # Condition 2
    (coffee['Coffee Type'] == 'Cappuccino')      # Condition 3
]

# Define corresponding values for each condition
values = [3.99, 4.49, 4.99]

# Use np.select() to assign values based on conditions
coffee['new_price'] = np.select(conditions, values, default=5.99)

coffee

          Day Coffee Type  Units Sold  price  new_price
0      Monday    Espresso          25   4.99       3.99
1      Monday       Latte          15   4.99       4.49
2     Tuesday    Espresso          30   4.99       3.99
3     Tuesday       Latte          20   4.99       4.49
4   Wednesday    Espresso          35   4.99       3.99
5   Wednesday       Latte          25   4.99       4.49
6    Thursday    Espresso          40   4.99       3.99
7    Thursday       Latte          30   4.99       4.49
8      Friday    Espresso          45   4.99       3.99
9      Friday       Latte          35   4.99       4.49
10   Saturday    Espresso          45   4.99       3.99
11   Saturday       Latte          35   4.99       4.49
12     Sunday    Espresso          45   4.99       3.99
13     Sunday       Latte          35   4.99       4.49

In [56]:
coffee['revenue'] = coffee['Units Sold'] * coffee['new_price']

coffee

          Day Coffee Type  Units Sold  price  new_price  revenue
0      Monday    Espresso          25   4.99       3.99    99.75
1      Monday       Latte          15   4.99       4.49    67.35
2     Tuesday    Espresso          30   4.99       3.99   119.70
3     Tuesday       Latte          20   4.99       4.49    89.80
4   Wednesday    Espresso          35   4.99       3.99   139.65
5   Wednesday       Latte          25   4.99       4.49   112.25
6    Thursday    Espresso          40   4.99       3.99   159.60
7    Thursday       Latte          30   4.99       4.49   134.70
8      Friday    Espresso          45   4.99       3.99   179.55
9      Friday       Latte          35   4.99       4.49   157.15
10   Saturday    Espresso          45   4.99       3.99   179.55
11   Saturday       Latte          35   4.99       4.49   157.15
12     Sunday    Espresso          45   4.99       3.99   179.55
13     Sunday       Latte          35   4.99       4.49   157.15

> Let's add some new columns to our bios dataframe

In [57]:
bios_new = bios.copy()

In [58]:
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0] # Add a new column 'first_name'. For every row
# split the the 'name' column string at the space ' ' and take the left value. Assign that value to the 'first_name' column.

bios_new.loc[:, ['first_name']]

           first_name
0       Jean-François
1              Arnaud
2                Jean
3             Jacques
4              Albert
...               ...
145495         Polina
145496       Valeriya
145497         Yuliya
145498          André
145499           Bill

[145500 rows x 1 columns]

In [59]:
bios_new.query('first_name == "Petros" and born_region == "Attiki"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
22206,22372,Petros Manos,1871-04-07,Athina (Athens),Attiki,GRE,Greece,NaN,NaN,1918-04-04,Petros
30112,30342,Petros Persakis,1879-01-01,Athina (Athens),Attiki,GRE,Greece,NaN,NaN,NaN,Petros
58059,58467,Petros Galaktopoulos,1945-06-07,Athina (Athens),Attiki,GRE,Greece,172.0,74.0,NaN,Petros

> Let's add just the birth year of an athlete.

In [60]:
bios_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first_name    145500 non-null  object
dtypes: float64(2), int64(1), object(8)
memory usage: 12.2+ MB

In [61]:
bios_new['born_date'] = pd.to_datetime(bios_new['born_date']) # Convert from object to datetime64 object.

In [62]:
bios_new.info() # 'born_date' column is now a datetime type which makes it easier to get the year.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  datetime64[ns]
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first_name    145500 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(7)
memory usage: 12.2+ MB

In [63]:
bios_new['born_year'] = bios_new['born_date'].dt.year

bios_new[['name', 'born_year']]

                         name  born_year
0       Jean-François Blanchy     1886.0
1              Arnaud Boetsch     1969.0
2                Jean Borotra     1898.0
3             Jacques Brugnon     1895.0
4                Albert Canet     1878.0
...                       ...        ...
145495      Polina Luchnikova     2002.0
145496    Valeriya Merkusheva     1999.0
145497        Yuliya Smirnova     1998.0
145498         André Foussard     1899.0
145499          Bill Phillips     1913.0

[145500 rows x 2 columns]

> Using `.apply()`.

> **Note**: While using `.apply()` with custom functions is flexible, it's not always the most efficient approach. 
> Pandas offers **built-in** methods like `pd.cut()`, `np.where()`, or `pd.qcut()` that are optimized for specific tasks, run faster, and provide cleaner, more readable code. 
> Whenever possible, try to use these built-in functions instead of custom logic with `.apply()`, as they utilize pandas' internal optimizations for better performance.

In [64]:
bios_new['height_category'] = bios['height_cm'].apply(lambda x: 'Short' if x < 165 else ('Average' if x < 185 else 'Tall'))

bios_new[['name', 'height_cm', 'height_category']]

                         name  height_cm height_category
0       Jean-François Blanchy        NaN            Tall
1              Arnaud Boetsch      183.0         Average
2                Jean Borotra      183.0         Average
3             Jacques Brugnon      168.0         Average
4                Albert Canet        NaN            Tall
...                       ...        ...             ...
145495      Polina Luchnikova      167.0         Average
145496    Valeriya Merkusheva      168.0         Average
145497        Yuliya Smirnova      163.0           Short
145498         André Foussard      166.0         Average
145499          Bill Phillips        NaN            Tall

[145500 rows x 3 columns]

In [65]:
def categorize_athlete(row):
    if row['height_cm'] < 175 and row['weight_kg'] < 70:
        return 'Lightweight'
    elif row['height_cm'] < 185 or row['weight_kg'] <= 80:
        return 'Middleweight'
    else:
        return 'Heavyweight'
    
bios_new['weight_category'] = bios_new.apply(categorize_athlete, axis=1)

bios_new.loc[0:15, ['name', 'height_cm', 'weight_kg', 'weight_category']]

                       name  height_cm  weight_kg weight_category
0     Jean-François Blanchy        NaN        NaN     Heavyweight
1            Arnaud Boetsch      183.0       76.0    Middleweight
2              Jean Borotra      183.0       76.0    Middleweight
3           Jacques Brugnon      168.0       64.0     Lightweight
4              Albert Canet        NaN        NaN     Heavyweight
5         Nicolas Chatelain      181.0       70.0    Middleweight
6             Patrick Chila      180.0       73.0    Middleweight
7              Henri Cochet        NaN        NaN     Heavyweight
8             Marcel Cousin        NaN        NaN     Heavyweight
9        Guy de la Chapelle        NaN        NaN     Heavyweight
10  Élie, Comte de Lastours        NaN        NaN     Heavyweight
11              Max Decugis        NaN        NaN     Heavyweight
12                J. Defert        NaN        NaN     Heavyweight
13           Étienne Durand        NaN        NaN     Heavyweight
14              Damien Éloi      165.0       58.0     Lightweight
15   Adrien Fauchier-Magnan        NaN        NaN     Heavyweight

### Removing Entries

In [66]:
coffee.drop(columns=['price']) # Drop the column 'price'.

          Day Coffee Type  Units Sold  new_price  revenue
0      Monday    Espresso          25       3.99    99.75
1      Monday       Latte          15       4.49    67.35
2     Tuesday    Espresso          30       3.99   119.70
3     Tuesday       Latte          20       4.49    89.80
4   Wednesday    Espresso          35       3.99   139.65
5   Wednesday       Latte          25       4.49   112.25
6    Thursday    Espresso          40       3.99   159.60
7    Thursday       Latte          30       4.49   134.70
8      Friday    Espresso          45       3.99   179.55
9      Friday       Latte          35       4.49   157.15
10   Saturday    Espresso          45       3.99   179.55
11   Saturday       Latte          35       4.49   157.15
12     Sunday    Espresso          45       3.99   179.55
13     Sunday       Latte          35       4.49   157.15

> **Note**: As you can see, the `coffee` DataFrame still has the `'price'` column. This happened because we did not actually modify the DataFrame; instead, we returned a modified version of it. When using the `.drop()` method without `inplace=True`, the original DataFrame remains unchanged, and a new modified version is returned.

In [67]:
coffee

          Day Coffee Type  Units Sold  price  new_price  revenue
0      Monday    Espresso          25   4.99       3.99    99.75
1      Monday       Latte          15   4.99       4.49    67.35
2     Tuesday    Espresso          30   4.99       3.99   119.70
3     Tuesday       Latte          20   4.99       4.49    89.80
4   Wednesday    Espresso          35   4.99       3.99   139.65
5   Wednesday       Latte          25   4.99       4.49   112.25
6    Thursday    Espresso          40   4.99       3.99   159.60
7    Thursday       Latte          30   4.99       4.49   134.70
8      Friday    Espresso          45   4.99       3.99   179.55
9      Friday       Latte          35   4.99       4.49   157.15
10   Saturday    Espresso          45   4.99       3.99   179.55
11   Saturday       Latte          35   4.99       4.49   157.15
12     Sunday    Espresso          45   4.99       3.99   179.55
13     Sunday       Latte          35   4.99       4.49   157.15

> **Important**: The following code should only be run **once**:
> ```python
> coffee.drop(columns=['price'], inplace=True)
> ```
> Running `.drop()` with `inplace=True` will permanently remove the `'price'` column from the `coffee` DataFrame. If you attempt to run this code again, it will result in an error since the `'price'` column will no longer exist in the DataFrame.

In [68]:
coffee.drop(columns=['price'], inplace=True)

coffee

          Day Coffee Type  Units Sold  new_price  revenue
0      Monday    Espresso          25       3.99    99.75
1      Monday       Latte          15       4.49    67.35
2     Tuesday    Espresso          30       3.99   119.70
3     Tuesday       Latte          20       4.49    89.80
4   Wednesday    Espresso          35       3.99   139.65
5   Wednesday       Latte          25       4.49   112.25
6    Thursday    Espresso          40       3.99   159.60
7    Thursday       Latte          30       4.49   134.70
8      Friday    Espresso          45       3.99   179.55
9      Friday       Latte          35       4.49   157.15
10   Saturday    Espresso          45       3.99   179.55
11   Saturday       Latte          35       4.49   157.15
12     Sunday    Espresso          45       3.99   179.55
13     Sunday       Latte          35       4.49   157.15

> **Note**: To create a copy of a DataFrame, using `coffee_copy = coffee` is **incorrect**. Instead, use `coffee_copy = coffee.copy()`. 
> In the first case, `coffee_copy` and `coffee` point to the **same memory location**, meaning that any changes made to one DataFrame will be reflected in the other. By using `.copy()`, you create an independent copy of the DataFrame, allowing changes to be made without affecting the original.

In [69]:
coffee_copy = coffee

coffee_copy['new_column'] = 100

coffee # Notice how we modified the `coffee_copy` variable and not the `coffee` variable directly.

          Day Coffee Type  Units Sold  new_price  revenue  new_column
0      Monday    Espresso          25       3.99    99.75         100
1      Monday       Latte          15       4.49    67.35         100
2     Tuesday    Espresso          30       3.99   119.70         100
3     Tuesday       Latte          20       4.49    89.80         100
4   Wednesday    Espresso          35       3.99   139.65         100
5   Wednesday       Latte          25       4.49   112.25         100
6    Thursday    Espresso          40       3.99   159.60         100
7    Thursday       Latte          30       4.49   134.70         100
8      Friday    Espresso          45       3.99   179.55         100
9      Friday       Latte          35       4.49   157.15         100
10   Saturday    Espresso          45       3.99   179.55         100
11   Saturday       Latte          35       4.49   157.15         100
12     Sunday    Espresso          45       3.99   179.55         100
13     Sunday       Latte          35       4.49   157.15         100

In [70]:
coffee.drop(columns=['new_column'], inplace=True) # Careful with this code. Delete the previously added 'new_column'.

coffee_copy = coffee.copy() # Use `.copy()`.

coffee_copy['new_column'] = 100 # Add 'new_column' to the `coffee_copy` dataframe.

coffee # The `coffee` dataframe was not affected.

          Day Coffee Type  Units Sold  new_price  revenue
0      Monday    Espresso          25       3.99    99.75
1      Monday       Latte          15       4.49    67.35
2     Tuesday    Espresso          30       3.99   119.70
3     Tuesday       Latte          20       4.49    89.80
4   Wednesday    Espresso          35       3.99   139.65
5   Wednesday       Latte          25       4.49   112.25
6    Thursday    Espresso          40       3.99   159.60
7    Thursday       Latte          30       4.49   134.70
8      Friday    Espresso          45       3.99   179.55
9      Friday       Latte          35       4.49   157.15
10   Saturday    Espresso          45       3.99   179.55
11   Saturday       Latte          35       4.49   157.15
12     Sunday    Espresso          45       3.99   179.55
13     Sunday       Latte          35       4.49   157.15

In [71]:
coffee_copy # Display that the 'new_column' was added.

          Day Coffee Type  Units Sold  new_price  revenue  new_column
0      Monday    Espresso          25       3.99    99.75         100
1      Monday       Latte          15       4.49    67.35         100
2     Tuesday    Espresso          30       3.99   119.70         100
3     Tuesday       Latte          20       4.49    89.80         100
4   Wednesday    Espresso          35       3.99   139.65         100
5   Wednesday       Latte          25       4.49   112.25         100
6    Thursday    Espresso          40       3.99   159.60         100
7    Thursday       Latte          30       4.49   134.70         100
8      Friday    Espresso          45       3.99   179.55         100
9      Friday       Latte          35       4.49   157.15         100
10   Saturday    Espresso          45       3.99   179.55         100
11   Saturday       Latte          35       4.49   157.15         100
12     Sunday    Espresso          45       3.99   179.55         100
13     Sunday       Latte          35       4.49   157.15         100

**Alternative ways to drop a column**

In [72]:
coffee_drop_example = coffee.copy() # Reset the coffee dataframe.
coffee_drop_example = coffee_drop_example.drop(columns=['Day']) # Assign the modified dataframe that is returned from `.drop()`.

coffee_drop_example

   Coffee Type  Units Sold  new_price  revenue
0     Espresso          25       3.99    99.75
1        Latte          15       4.49    67.35
2     Espresso          30       3.99   119.70
3        Latte          20       4.49    89.80
4     Espresso          35       3.99   139.65
5        Latte          25       4.49   112.25
6     Espresso          40       3.99   159.60
7        Latte          30       4.49   134.70
8     Espresso          45       3.99   179.55
9        Latte          35       4.49   157.15
10    Espresso          45       3.99   179.55
11       Latte          35       4.49   157.15
12    Espresso          45       3.99   179.55
13       Latte          35       4.49   157.15

In [73]:
coffee_drop_example = coffee_drop_example[['Coffee Type', 'new_price']] # Select the columns that you are interested in, dropping the others.

coffee_drop_example

   Coffee Type  new_price
0     Espresso       3.99
1        Latte       4.49
2     Espresso       3.99
3        Latte       4.49
4     Espresso       3.99
5        Latte       4.49
6     Espresso       3.99
7        Latte       4.49
8     Espresso       3.99
9        Latte       4.49
10    Espresso       3.99
11       Latte       4.49
12    Espresso       3.99
13       Latte       4.49

## Renaming Columns
Renaming columns in a DataFrame is an essential operation when dealing with messy or poorly named datasets. Pandas provides the `.rename()` function to rename columns based on a mapping or by directly passing new column names.

In [74]:
coffee

          Day Coffee Type  Units Sold  new_price  revenue
0      Monday    Espresso          25       3.99    99.75
1      Monday       Latte          15       4.49    67.35
2     Tuesday    Espresso          30       3.99   119.70
3     Tuesday       Latte          20       4.49    89.80
4   Wednesday    Espresso          35       3.99   139.65
5   Wednesday       Latte          25       4.49   112.25
6    Thursday    Espresso          40       3.99   159.60
7    Thursday       Latte          30       4.49   134.70
8      Friday    Espresso          45       3.99   179.55
9      Friday       Latte          35       4.49   157.15
10   Saturday    Espresso          45       3.99   179.55
11   Saturday       Latte          35       4.49   157.15
12     Sunday    Espresso          45       3.99   179.55
13     Sunday       Latte          35       4.49   157.15

In [75]:
coffee.rename(columns={'new_price':'price'})

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso          25   3.99    99.75
1      Monday       Latte          15   4.49    67.35
2     Tuesday    Espresso          30   3.99   119.70
3     Tuesday       Latte          20   4.49    89.80
4   Wednesday    Espresso          35   3.99   139.65
5   Wednesday       Latte          25   4.49   112.25
6    Thursday    Espresso          40   3.99   159.60
7    Thursday       Latte          30   4.49   134.70
8      Friday    Espresso          45   3.99   179.55
9      Friday       Latte          35   4.49   157.15
10   Saturday    Espresso          45   3.99   179.55
11   Saturday       Latte          35   4.49   157.15
12     Sunday    Espresso          45   3.99   179.55
13     Sunday       Latte          35   4.49   157.15

> Observe that the name did no actually change. We need to use one of the above methods mentioned above to modify the original dataframe.

In [76]:
coffee

          Day Coffee Type  Units Sold  new_price  revenue
0      Monday    Espresso          25       3.99    99.75
1      Monday       Latte          15       4.49    67.35
2     Tuesday    Espresso          30       3.99   119.70
3     Tuesday       Latte          20       4.49    89.80
4   Wednesday    Espresso          35       3.99   139.65
5   Wednesday       Latte          25       4.49   112.25
6    Thursday    Espresso          40       3.99   159.60
7    Thursday       Latte          30       4.49   134.70
8      Friday    Espresso          45       3.99   179.55
9      Friday       Latte          35       4.49   157.15
10   Saturday    Espresso          45       3.99   179.55
11   Saturday       Latte          35       4.49   157.15
12     Sunday    Espresso          45       3.99   179.55
13     Sunday       Latte          35       4.49   157.15

In [77]:
coffee = coffee.rename(columns={'new_price':'price'})

coffee # Now the column 'new_price' did change to 'price'.

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso          25   3.99    99.75
1      Monday       Latte          15   4.49    67.35
2     Tuesday    Espresso          30   3.99   119.70
3     Tuesday       Latte          20   4.49    89.80
4   Wednesday    Espresso          35   3.99   139.65
5   Wednesday       Latte          25   4.49   112.25
6    Thursday    Espresso          40   3.99   159.60
7    Thursday       Latte          30   4.49   134.70
8      Friday    Espresso          45   3.99   179.55
9      Friday       Latte          35   4.49   157.15
10   Saturday    Espresso          45   3.99   179.55
11   Saturday       Latte          35   4.49   157.15
12     Sunday    Espresso          45   3.99   179.55
13     Sunday       Latte          35   4.49   157.15

## Saving Dataframe to a file
Store your modified or new dataframe to a file.

In [78]:
bios_new.to_csv('./data/bios_new.csv', index=False)

## Combining DataFrames: Merging and Concatenating

Combine multiple DataFrames using pandas' powerful merging and concatenating functions. This is like adding, at a bigger scale.

### Merging DataFrames
- **Merging** involves combining two DataFrames based on a key or set of keys, similar to SQL joins.
- Use cases and examples for `pd.merge()`, including different types of joins (inner, outer, left, right).

> Example: Merge the *nocs* file with the *bios* file, to display the full country name of an athlete.

In [79]:
nocs = pd.read_csv('./data/noc_regions.csv')
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [80]:
nocs.head() # We are interested in the 'region' column.

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

> Pay attention that when both files have a column with the same naming, pandas adds a suffix (_x for bios and _y for nocs). You can edit that suffix if you want to by adding the `suffixes=[]` parameter in the `pd.merge()` function. For example: `suffixes=['bios', 'noc']`.

In [81]:
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='left')

bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,region,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN

In [82]:
bios_new.rename(columns={'region': 'born_country_full'}, inplace=True)

bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,NOC_y,born_country_full,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,GBR,UK,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,RUS,Russia,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,RUS,Russia,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,RUS,Russia,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,FRA,France,NaN
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,AUS,Australia,NaN

In [83]:
bios_new[bios_new['NOC_x'] != bios_new['born_country_full']][['name', 'NOC_x', 'born_country_full']]

                       name    NOC_x born_country_full
4              Albert Canet   France                UK
12                J. Defert   France               NaN
13           Étienne Durand   France               NaN
16               Guy Forget   France           Morocco
27       Guy, Baron Lejeune   France               NaN
...                     ...      ...               ...
145491        Matthew Wepke  Jamaica               NaN
145493   Landysh Falyakhova      ROC            Russia
145495    Polina Luchnikova      ROC            Russia
145496  Valeriya Merkusheva      ROC            Russia
145497      Yuliya Smirnova      ROC            Russia

[73210 rows x 3 columns]

### Concatenating DataFrames
- **Concatenating** involves stacking DataFrames either **vertically (adding rows)** or **horizontally (adding columns)**.
- Use cases and examples for `pd.concat()`, with a focus on concatenating along different axes (rows or columns).

> Example: Create a dataframe that has only athletes born in the USA and GBR

In [84]:
usa = bios[bios['born_country']=='USA'].copy()
gbr = bios[bios['born_country']=='GBR'].copy()

In [85]:
usa.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN
960,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN
961,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN

In [86]:
gbr.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
37,38,Helen Aitchison,1881-12-06,Sunderland,England,GBR,Great Britain,NaN,NaN,1947-05-26
38,39,Geraldine Beamish,1883-06-23,Forest Gate,England,GBR,Great Britain,NaN,NaN,1972-05-10
39,40,Dora Boothby,1881-08-02,Finchley,England,GBR,Great Britain,NaN,NaN,1970-02-22
40,41,Julie Bradbury,1967-02-12,Oxford,England,GBR,Great Britain,175.0,64.0,NaN

In [87]:
usa_and_gbr = pd.concat([usa, gbr]) # USA athletes will be first and then the method will concatenate the GBR athletes.
# You can see this using the 'head()' and 'tail()' methods. 'head()' will display USA athletes while 'tail()' will display GBR athletes.

usa_and_gbr.sample(10)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
44324,44664,Bob Foth,1958-07-03,Buffalo,New York,USA,United States,178.0,70.0,NaN
40482,40791,Tim Mickelson,1948-11-12,Deerfield,Wisconsin,USA,United States,191.0,85.0,2017-08-30
77432,78023,Dave Abbott,1902-03-08,Providence,Rhode Island,USA,United States,183.0,75.0,1987-05-19
12924,12995,William West,1887-07-15,Whitesville,Georgia,USA,United States,NaN,NaN,1953-09-15
40320,40629,Dave Dunlap,1910-11-19,Napa,California,USA,United States,189.0,86.0,1994-12-16
21976,22135,Geoffrey Grimmett,1950-12-20,Birmingham,England,GBR,Great Britain,190.0,84.0,NaN
92716,93460,Steve Parry,1977-03-02,Liverpool,England,GBR,Great Britain,194.0,90.0,NaN
92105,92839,Hugh Styles,1974-06-25,Dover,England,GBR,Great Britain,185.0,79.0,NaN
37102,37397,John Maxey,1958-07-19,Royal Tunbridge Wells,England,GBR,Great Britain,187.0,93.0,NaN
86224,86911,Dwain Chambers,1978-04-05,Finsbury,England,GBR,Great Britain,180.0,83.0,NaN

### Handling `NaN` Values

Various methods to handle NaN values.

In [109]:
coffee.loc[[0,1], 'Units Sold'] = np.nan

coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso         NaN   3.99    99.75
1      Monday       Latte         NaN   4.49    67.35
2     Tuesday    Espresso        30.0   3.99   119.70
3     Tuesday       Latte        20.0   4.49    89.80
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        25.0   4.49   112.25
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   4.49   134.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   4.49   157.15
10   Saturday    Espresso        45.0   3.99   179.55
11   Saturday       Latte        35.0   4.49   157.15
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        35.0   4.49   157.15

> Notice that the `'Units Sold'` has 12 non-null values in contrast with the other columns that have 14.

In [89]:
coffee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   12 non-null     float64
 3   price        14 non-null     float64
 4   revenue      14 non-null     float64
dtypes: float64(3), object(2)
memory usage: 692.0+ bytes

In [92]:
coffee.isnull().sum() # Show how many NaN values each column has.

Day            0
Coffee Type    0
Units Sold     2
price          0
revenue        0
dtype: int64

> **Note**: The `.fillna()` replaces all `NaN` values with a specified value. This approach is useful when you want to use a constant value, such as zero, the mean of the column, or a placeholder for missing data.

In [95]:
coffee.fillna(coffee['Units Sold'].mean())

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        35.0   3.99    99.75
1      Monday       Latte        35.0   4.49    67.35
2     Tuesday    Espresso        30.0   3.99   119.70
3     Tuesday       Latte        20.0   4.49    89.80
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        25.0   4.49   112.25
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   4.49   134.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   4.49   157.15
10   Saturday    Espresso        45.0   3.99   179.55
11   Saturday       Latte        35.0   4.49   157.15
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        35.0   4.49   157.15

> **Note**: The `interpolate()` method estimates missing values by identifying trends or patterns in the data. The missing value(s) must be between existing values.

In [117]:
coffee.loc[3:5, 'Units Sold'] = np.nan

coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        30.0   3.99    99.75
1      Monday       Latte        30.0   4.49    67.35
2     Tuesday    Espresso        30.0   3.99   119.70
3     Tuesday       Latte         NaN   4.49    89.80
4   Wednesday    Espresso         NaN   3.99   139.65
5   Wednesday       Latte         NaN   4.49   112.25
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   4.49   134.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   4.49   157.15
10   Saturday    Espresso        45.0   3.99   179.55
11   Saturday       Latte        35.0   4.49   157.15
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        35.0   4.49   157.15

In [118]:
coffee['Units Sold'] = coffee['Units Sold'].interpolate()

coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        30.0   3.99    99.75
1      Monday       Latte        30.0   4.49    67.35
2     Tuesday    Espresso        30.0   3.99   119.70
3     Tuesday       Latte        32.5   4.49    89.80
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        37.5   4.49   112.25
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   4.49   134.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   4.49   157.15
10   Saturday    Espresso        45.0   3.99   179.55
11   Saturday       Latte        35.0   4.49   157.15
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        35.0   4.49   157.15

> **Note**: The `ffill()` method fills missing values by carrying forward the last known value. This method is helpful when you want to assume that the missing values remained the same as the last recorded value.

In [119]:
coffee.loc[[10,13], 'Units Sold'] = np.nan

coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        30.0   3.99    99.75
1      Monday       Latte        30.0   4.49    67.35
2     Tuesday    Espresso        30.0   3.99   119.70
3     Tuesday       Latte        32.5   4.49    89.80
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        37.5   4.49   112.25
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   4.49   134.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   4.49   157.15
10   Saturday    Espresso         NaN   3.99   179.55
11   Saturday       Latte        35.0   4.49   157.15
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte         NaN   4.49   157.15

In [120]:
coffee['Units Sold'] = coffee['Units Sold'].ffill()

coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        30.0   3.99    99.75
1      Monday       Latte        30.0   4.49    67.35
2     Tuesday    Espresso        30.0   3.99   119.70
3     Tuesday       Latte        32.5   4.49    89.80
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        37.5   4.49   112.25
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   4.49   134.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   4.49   157.15
10   Saturday    Espresso        35.0   3.99   179.55
11   Saturday       Latte        35.0   4.49   157.15
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        45.0   4.49   157.15

> **Note**: The `bfill()` method fills missing values by using the next available value. This method is helpful when you want to assume that the missing values are the same as the next recorded value.

In [121]:
coffee.loc[[0,1], 'Units Sold'] = np.nan

coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso         NaN   3.99    99.75
1      Monday       Latte         NaN   4.49    67.35
2     Tuesday    Espresso        30.0   3.99   119.70
3     Tuesday       Latte        32.5   4.49    89.80
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        37.5   4.49   112.25
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   4.49   134.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   4.49   157.15
10   Saturday    Espresso        35.0   3.99   179.55
11   Saturday       Latte        35.0   4.49   157.15
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        45.0   4.49   157.15

In [122]:
coffee['Units Sold'] = coffee['Units Sold'].bfill()

coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        30.0   3.99    99.75
1      Monday       Latte        30.0   4.49    67.35
2     Tuesday    Espresso        30.0   3.99   119.70
3     Tuesday       Latte        32.5   4.49    89.80
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        37.5   4.49   112.25
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   4.49   134.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   4.49   157.15
10   Saturday    Espresso        35.0   3.99   179.55
11   Saturday       Latte        35.0   4.49   157.15
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        45.0   4.49   157.15

> **Note**: You can also delete (drop) the rows that have `NaN` values. This method should be used with caution, because it deletes a full row that has a `NaN` value.

In [130]:
coffee.loc[[0,1], 'Units Sold'] = np.nan

coffee.dropna() # Needs inplace=True or coffee = coffee.dropna() to actually change the dataframe.

          Day Coffee Type  Units Sold
2     Tuesday    Espresso        30.0
3     Tuesday       Latte        20.0
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

> **Note**: You can specify the method to only drop rows if a specific column has a `NaN` value.

In [131]:
coffee.dropna(subset=['Units Sold'])

          Day Coffee Type  Units Sold
2     Tuesday    Espresso        30.0
3     Tuesday       Latte        20.0
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

#### Display the rows that have `NaN` value(s) or the ones that don't.

In [132]:
coffee[coffee['Units Sold'].isna()]

      Day Coffee Type  Units Sold
0  Monday    Espresso         NaN
1  Monday       Latte         NaN

In [133]:
coffee[coffee['Units Sold'].notna()]

          Day Coffee Type  Units Sold
2     Tuesday    Espresso        30.0
3     Tuesday       Latte        20.0
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0